# Module 2

## Exercise 1 

Buatlah sebuah array dengan perintah arrange yang nilai start dan end adalah sebuah input

dari array yang terbentuk tersebut buatlah versi 2 dan 3 dimensinya

In [41]:
import numpy as np

start = int(input("masukkan angka untuk start: "))
end = int(input("masukkan angka untuk end: "))

arr1 = np.arange(start,end)

print(arr1)

masukkan angka untuk start: 1
masukkan angka untuk end: 28
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27]

In [42]:
# 2 dimensi
arr2 = arr1.reshape(3,9)

print(arr2)

[[ 1  2  3  4  5  6  7  8  9]
 [10 11 12 13 14 15 16 17 18]
 [19 20 21 22 23 24 25 26 27]]

In [43]:
# 3 dimensi
arr3 = arr1.reshape(3,3,3)

print(arr3)

[[[ 1  2  3]
  [ 4  5  6]
  [ 7  8  9]]

 [[10 11 12]
  [13 14 15]
  [16 17 18]]

 [[19 20 21]
  [22 23 24]
  [25 26 27]]]

## Exercise 2

* Buatlah sebuah array 1 dimensi dari data random integer sebanyak 'n', dimana 'n' tersebut adalah sebuah input
* Batasan random juga ditentukan dalam input
* Ubahlah array 1 dimensi tersebut ke dalam bentuk 2 dimensi atau matrix!
* Setelah diubah kebentuk 2 dimensi, setiap barisnya baliklah urutan datanya! misalnya dari 1,2,3 menjadi 3,2,1

In [46]:
import numpy as np

start = int(input("masukkan angka untuk start: "))
end = int(input("masukkan angka untuk end: "))
num = int(input("masukkan angka untuk jumlah angka: "))

arr1 = np.random.randint(start,end,num)

print(arr1)

masukkan angka untuk start: 0
masukkan angka untuk end: 32
masukkan angka untuk jumlah angka: 16
[16 15 14 27  8 12  5 11 16  0 28 25  6  6 20 29]

In [47]:
# 2 dimensi
arr2 = arr1.reshape(4,4)

print(arr2)

[[16 15 14 27]
 [ 8 12  5 11]
 [16  0 28 25]
 [ 6  6 20 29]]

In [48]:
# urutan data dibalik
print(arr2[:,::-1])

[[27 14 15 16]
 [11  5 12  8]
 [25 28  0 16]
 [29 20  6  6]]

## Exercise 3

* Buatlah sebuah array 2 dimensi dengan ukuran 10 x 10
* isi dari array tersebut adalah
    - sisi luarnya merupakan angka4
    - selain sisi luar, angka yang ditampilkan adalah 0

In [64]:
arr = np.full((10,10),4, dtype=float)
arr[1:-1,1:-1] = 0
print(arr)

[[4. 4. 4. 4. 4. 4. 4. 4. 4. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 0. 0. 0. 0. 0. 0. 0. 0. 4.]
 [4. 4. 4. 4. 4. 4. 4. 4. 4. 4.]]

## Exercise 4

* Buatlah sebuah Series dengan menggunakan library Pandas!
* Index pada Series tersebut berupa huruf lowercase dari a hingga z
* data dari tiap indexnya adalah nomor dari 1 hingga 26

In [7]:
import numpy as np
import pandas as pd

data = list(np.arange(1,27))
index = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z']

s = pd.Series(data, index=index)
print(s)

# solution:
# mylist = list('abcdefghijklmnopqrstuvwxyz')
# myarr = np.arange(1,27)
# mydict = dict(zip(mylist, myarr))
# pd.Series(mydict)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
dtype: int64

## Exercise 5

* Buatlah sebuah Series menggunakan angka random integer dari 1 hingga 5 sebanyak 100
* hitunglah banyaknya frekuensi tiap angka
* cari tahu 2 nilai dengan frekuensi tertinggi

In [9]:
num = list(np.random.randint(1,5,100))
s = pd.Series(num)
print(s)

0     1
1     4
2     4
3     2
4     2
     ..
95    2
96    2
97    2
98    1
99    4
Length: 100, dtype: int64

In [12]:
s1 = pd.Series(num,num)
count = s1.groupby(level=0).count()
count

1    23
2    28
3    25
4    24
dtype: int64

In [11]:
count = count.sort_values(ascending=False).reset_index()
df = pd.DataFrame(count).rename(columns={'index':'value',
                                         0:'frequency'})
df.head(2)

   value  frequency
0      2         28
1      3         25

## Exercise 6

* import library 'seaborn'. lalu, load data yang bernama "MPG"!
* tampilkan 5 data teratas pada dataframe dari data "mpg"
* tampilkan statistik deskriptif atau describe data selain data numerik
* tampilkan seluruh nama kolom pada dataframe
* hitung jumlah missing value di setiap kolomnya

In [4]:
import pandas as pd
import seaborn as sns

mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [55]:
mpg.describe(include=object)

       origin        name
count     398         398
unique      3         305
top       usa  ford pinto
freq      249           6

In [56]:
mpg.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [57]:
mpg.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

## Exercise 7

* import library 'seaborn', lalu load data yang bernama "MPG"
* tampilkan missing value pada kolom 'horsepower'
* tampilkan index lokasi missing value tersebut

In [3]:
import pandas as pd
import seaborn as sns

mpg = sns.load_dataset('mpg')
missing_mpg = mpg[mpg['horsepower'].isna() == True]
missing_mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
32,25.0,4,98.0,NaN,2046,19.0,71,usa,ford pinto
126,21.0,6,200.0,NaN,2875,17.0,74,usa,ford maverick
330,40.9,4,85.0,NaN,1835,17.3,80,europe,renault lecar deluxe
336,23.6,4,140.0,NaN,2905,14.3,80,usa,ford mustang cobra
354,34.5,4,100.0,NaN,2320,15.8,81,europe,renault 18i
374,23.0,4,151.0,NaN,3035,20.5,82,usa,amc concord dl

In [59]:
print(missing_mpg.index)

Int64Index([32, 126, 330, 336, 354, 374], dtype='int64')

## Exercise 8

* import library 'seaborn', lalu load data yang bernama "MPG"
* lakukan grouping atau pengelompokan berdasarkan kolom 'origin'!
* tampilkan rata-rata dari 'horsepower' di setiap kelompok origin nya

In [60]:
import pandas as pd
import seaborn as sns

mpg = sns.load_dataset('mpg')
mpg.groupby(by=['origin']).mean()['horsepower']

origin
europe     80.558824
japan      79.835443
usa       119.048980
Name: horsepower, dtype: float64

## Exercise 9
* import library 'seaborn', lalu load data yang bernama "MPG"
* buatlah sebuah kolom baru yang bernama 'house_origin'
* kolom 'horse_origin' ini harus diisi menggunakan fungsi berisikan
    - jika nilai 'horsepower' <= 105, tampilkan 'lower' + 'nama origin' pada barus yang sama
    - jika nilai 'horsepower' >= 105, tampilkan 'upper' + 'nama origin'

In [2]:
import pandas as pd
import seaborn as sns

mpg = sns.load_dataset('mpg')

def func(x,y):
    a = []
    for i in range(len(x)):    
        if x[i] <= 105:
            a.append('lower ' + y[i])
        else:
            a.append('upper ' + y[i])
    return a

mpg['horse_origin'] = func(mpg['horsepower'], mpg['origin'])

mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,horse_origin
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,lower usa
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,lower europe
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,lower usa
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,lower usa
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,lower usa

## Exercise 9
* import library 'seaborn', lalu load data yang bernama "MPG"
* lakukan pengelompokan atau grouping kolom 'weight' berdasarkan kolom 'origin' dengan agregating mean, std, sum, count, min, dan max
* lakukan reset index segingga kolom 'origin' tidak lagi menjadi index, tetapi tetap menjadi kolom

In [1]:
import pandas as pd
import seaborn as sns

mpg = sns.load_dataset('mpg')
df = pd.DataFrame(mpg.groupby(by=['origin'])['weight'].describe())
df = df.reset_index()
df

,origin,count,mean,std,min,25%,50%,75%,max
0,europe,70.0,2423.300000,490.043191,1825.0,2067.25,2240.0,2769.75,3820.0
1,japan,79.0,2221.227848,320.497248,1613.0,1985.00,2155.0,2412.50,2930.0
2,usa,249.0,3361.931727,794.792506,1800.0,2720.00,3365.0,4054.00,5140.0

In [70]:
mpg_agg = mpg[['weight', 'origin']].groupby(by=['origin']).agg(mean = pd.NamedAgg(column='weight', aggfunc='mean'),
                                                               std = pd.NamedAgg(column='weight', aggfunc='std'),
                                                               sum = pd.NamedAgg(column='weight', aggfunc='sum'),
                                                               count = pd.NamedAgg(column='weight', aggfunc='count'),
                                                               min = pd.NamedAgg(column='weight', aggfunc='min'),
                                                               max = pd.NamedAgg(column='weight', aggfunc='max'),
                                                              )
mpg_agg.reset_index()

   origin         mean         std     sum  count   min   max
0  europe  2423.300000  490.043191  169631     70  1825  3820
1   japan  2221.227848  320.497248  175477     79  1613  2930
2     usa  3361.931727  794.792506  837121    249  1800  5140